Revit 2026 API

# RebarFreeFormAccessorSetLayoutAsMinimumClearSpacing Method

---

Sets the Layout Rule property of rebar set to Minimum Clear Spacing.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutAsMinimumClearSpacing(
	double spacing
)
```
```vb
Public Sub SetLayoutAsMinimumClearSpacing (
	spacing As Double
)
```
```cpp
public:
void SetLayoutAsMinimumClearSpacing(
	double spacing
)
```
```fsharp
member SetLayoutAsMinimumClearSpacing :
        spacing : float -> unit
```

#### Parameters

spacing Double
     The maximum spacing of bars in set.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace